app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post.destroy!